badenwork/hal_nuvoton/dts/pinctrl/m2354ljfae-pinctrl.h
/*
 * Copyright (c) 2024 Batrak Denys (baden.i.ua@gmail.com)
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "../m2354/sys_reg.h"
#include "../m2354/sys.h"

#define NVT_PINMUX(port, pinIndex, mfp) \
    ((((port) - 'A') << 28)| \
    ((pinIndex) << 24) | \
    ((mfp) >> ((pinIndex %4)*8)))

// Parced by parcer.py script

#define PA0MFP_GPIO		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_GPIO)
#define PA0MFP_QSPI0_MOSI0		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_QSPI0_MOSI0)
#define PA0MFP_SPI0_MOSI		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_SPI0_MOSI)
#define PA0MFP_LCD_COM6		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_LCD_COM6)
#define PA0MFP_LCD_SEG14		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_LCD_SEG14)
#define PA0MFP_SC0_CLK		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_SC0_CLK)
#define PA0MFP_UART0_RXD		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_UART0_RXD)
#define PA0MFP_I2C2_SDA		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_I2C2_SDA)
#define PA0MFP_LCD_SEG24		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_LCD_SEG24)
#define PA0MFP_BPWM0_CH0		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_BPWM0_CH0)
#define PA0MFP_EPWM0_CH5		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_EPWM0_CH5)
#define PA0MFP_DAC0_ST		NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_DAC0_ST)
#define PA1MFP_GPIO		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_GPIO)
#define PA1MFP_QSPI0_MISO0		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_QSPI0_MISO0)
#define PA1MFP_SPI0_MISO		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_SPI0_MISO)
#define PA1MFP_LCD_COM7		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_LCD_COM7)
#define PA1MFP_LCD_SEG13		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_LCD_SEG13)
#define PA1MFP_SC0_DAT		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_SC0_DAT)
#define PA1MFP_UART0_TXD		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_UART0_TXD)
#define PA1MFP_I2C2_SCL		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_I2C2_SCL)
#define PA1MFP_LCD_SEG25		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_LCD_SEG25)
#define PA1MFP_BPWM0_CH1		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_BPWM0_CH1)
#define PA1MFP_EPWM0_CH4		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_EPWM0_CH4)
#define PA1MFP_DAC1_ST		NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_DAC1_ST)
#define PA2MFP_GPIO		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_GPIO)
#define PA2MFP_QSPI0_CLK		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_QSPI0_CLK)
#define PA2MFP_SPI0_CLK		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_SPI0_CLK)
#define PA2MFP_LCD_SEG3		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_LCD_SEG3)
#define PA2MFP_SC0_RST		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_SC0_RST)
#define PA2MFP_UART4_RXD		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_UART4_RXD)
#define PA2MFP_UART1_RXD		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_UART1_RXD)
#define PA2MFP_I2C1_SDA		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_I2C1_SDA)
#define PA2MFP_I2C0_SMBSUS		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_I2C0_SMBSUS)
#define PA2MFP_LCD_SEG26		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_LCD_SEG26)
#define PA2MFP_BPWM0_CH2		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_BPWM0_CH2)
#define PA2MFP_EPWM0_CH3		NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_EPWM0_CH3)
#define PA3MFP_GPIO		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_GPIO)
#define PA3MFP_QSPI0_SS		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_QSPI0_SS)
#define PA3MFP_SPI0_SS		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_SPI0_SS)
#define PA3MFP_LCD_SEG4		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_LCD_SEG4)
#define PA3MFP_SC0_PWR		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_SC0_PWR)
#define PA3MFP_UART4_TXD		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_UART4_TXD)
#define PA3MFP_UART1_TXD		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_UART1_TXD)
#define PA3MFP_I2C1_SCL		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_I2C1_SCL)
#define PA3MFP_I2C0_SMBAL		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_I2C0_SMBAL)
#define PA3MFP_LCD_SEG27		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_LCD_SEG27)
#define PA3MFP_BPWM0_CH3		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_BPWM0_CH3)
#define PA3MFP_EPWM0_CH2		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_EPWM0_CH2)
#define PA3MFP_QEI0_B		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_QEI0_B)
#define PA3MFP_EPWM1_BRAKE1		NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_EPWM1_BRAKE1)
#define PA4MFP_GPIO		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_GPIO)
#define PA4MFP_QSPI0_MOSI1		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_QSPI0_MOSI1)
#define PA4MFP_SPI0_I2SMCLK		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_SPI0_I2SMCLK)
#define PA4MFP_LCD_SEG5		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_LCD_SEG5)
#define PA4MFP_UART5_RXD		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_UART5_RXD)
#define PA4MFP_I2C0_SDA		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_I2C0_SDA)
#define PA4MFP_CAN0_RXD		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_CAN0_RXD)
#define PA4MFP_UART0_RXD		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_UART0_RXD)
#define PA4MFP_BPWM0_CH4		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_BPWM0_CH4)
#define PA4MFP_EPWM0_CH1		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_EPWM0_CH1)
#define PA4MFP_QEI0_A		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_QEI0_A)
#define PA4MFP_LCD_SEG28		NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_LCD_SEG28)
#define PA5MFP_GPIO		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_GPIO)
#define PA5MFP_QSPI0_MISO1		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_QSPI0_MISO1)
#define PA5MFP_SPI1_I2SMCLK		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_SPI1_I2SMCLK)
#define PA5MFP_LCD_SEG6		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_LCD_SEG6)
#define PA5MFP_UART5_TXD		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_UART5_TXD)
#define PA5MFP_I2C0_SCL		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_I2C0_SCL)
#define PA5MFP_CAN0_TXD		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_CAN0_TXD)
#define PA5MFP_UART0_TXD		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_UART0_TXD)
#define PA5MFP_BPWM0_CH5		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_BPWM0_CH5)
#define PA5MFP_EPWM0_CH0		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_EPWM0_CH0)
#define PA5MFP_QEI0_INDEX		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_QEI0_INDEX)
#define PA5MFP_LCD_SEG29		NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_LCD_SEG29)
#define PA6MFP_GPIO		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_GPIO)
#define PA6MFP_EBI_AD6		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_EBI_AD6)
#define PA6MFP_SPI1_SS		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_SPI1_SS)
#define PA6MFP_SC2_CLK		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_SC2_CLK)
#define PA6MFP_UART0_RXD		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_UART0_RXD)
#define PA6MFP_I2C1_SDA		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_I2C1_SDA)
#define PA6MFP_LCD_SEG7		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_LCD_SEG7)
#define PA6MFP_TM5		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_TM5)
#define PA6MFP_EPWM1_CH5		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_EPWM1_CH5)
#define PA6MFP_BPWM1_CH3		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_BPWM1_CH3)
#define PA6MFP_ACMP1_WLAT		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_ACMP1_WLAT)
#define PA6MFP_TM3		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_TM3)
#define PA6MFP_INT0		NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_INT0)
#define PA7MFP_GPIO		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_GPIO)
#define PA7MFP_EBI_AD7		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_EBI_AD7)
#define PA7MFP_SPI1_CLK		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_SPI1_CLK)
#define PA7MFP_SC2_DAT		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_SC2_DAT)
#define PA7MFP_UART0_TXD		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_UART0_TXD)
#define PA7MFP_I2C1_SCL		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_I2C1_SCL)
#define PA7MFP_LCD_SEG8		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_LCD_SEG8)
#define PA7MFP_TM4		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_TM4)
#define PA7MFP_EPWM1_CH4		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_EPWM1_CH4)
#define PA7MFP_BPWM1_CH2		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_BPWM1_CH2)
#define PA7MFP_ACMP0_WLAT		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_ACMP0_WLAT)
#define PA7MFP_TM2		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_TM2)
#define PA7MFP_INT1		NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_INT1)
#define PA8MFP_GPIO		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_GPIO)
#define PA8MFP_EBI_ALE		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_EBI_ALE)
#define PA8MFP_SC2_CLK		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_SC2_CLK)
#define PA8MFP_SPI2_MOSI		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_SPI2_MOSI)
#define PA8MFP_USCI0_CTL1		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_USCI0_CTL1)
#define PA8MFP_UART1_RXD		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_UART1_RXD)
#define PA8MFP_BPWM0_CH3		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_BPWM0_CH3)
#define PA8MFP_QEI1_B		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_QEI1_B)
#define PA8MFP_ECAP0_IC2		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_ECAP0_IC2)
#define PA8MFP_TM5_EXT		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_TM5_EXT)
#define PA8MFP_TM3_EXT		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_TM3_EXT)
#define PA8MFP_LCD_SEG11		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_LCD_SEG11)
#define PA8MFP_INT4		NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_INT4)
#define PA9MFP_GPIO		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_GPIO)
#define PA9MFP_EBI_MCLK		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_EBI_MCLK)
#define PA9MFP_SC2_DAT		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_SC2_DAT)
#define PA9MFP_SPI2_MISO		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_SPI2_MISO)
#define PA9MFP_USCI0_DAT1		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_USCI0_DAT1)
#define PA9MFP_UART1_TXD		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_UART1_TXD)
#define PA9MFP_BPWM0_CH2		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_BPWM0_CH2)
#define PA9MFP_QEI1_A		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_QEI1_A)
#define PA9MFP_ECAP0_IC1		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_ECAP0_IC1)
#define PA9MFP_TM4_EXT		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_TM4_EXT)
#define PA9MFP_TM2_EXT		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_TM2_EXT)
#define PA9MFP_LCD_SEG12		NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_LCD_SEG12)
#define PA10MFP_GPIO		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_GPIO)
#define PA10MFP_ACMP1_P0		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_ACMP1_P0)
#define PA10MFP_SC2_RST		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_SC2_RST)
#define PA10MFP_SPI2_CLK		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_SPI2_CLK)
#define PA10MFP_USCI0_DAT0		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_USCI0_DAT0)
#define PA10MFP_I2C2_SDA		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_I2C2_SDA)
#define PA10MFP_BPWM0_CH1		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_BPWM0_CH1)
#define PA10MFP_QEI1_INDEX		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_QEI1_INDEX)
#define PA10MFP_ECAP0_IC0		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_ECAP0_IC0)
#define PA10MFP_TM1_EXT		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_TM1_EXT)
#define PA10MFP_DAC0_ST		NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_DAC0_ST)
#define PA11MFP_GPIO		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_GPIO)
#define PA11MFP_ACMP0_P0		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_ACMP0_P0)
#define PA11MFP_SC2_PWR		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_SC2_PWR)
#define PA11MFP_SPI2_SS		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_SPI2_SS)
#define PA11MFP_USCI0_CLK		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_USCI0_CLK)
#define PA11MFP_I2C2_SCL		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_I2C2_SCL)
#define PA11MFP_BPWM0_CH0		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_BPWM0_CH0)
#define PA11MFP_EPWM0_SYNC_OUT		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_EPWM0_SYNC_OUT)
#define PA11MFP_TM0_EXT		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_TM0_EXT)
#define PA11MFP_DAC1_ST		NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_DAC1_ST)
#define PA12MFP_GPIO		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_GPIO)
#define PA12MFP_I2S0_BCLK		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_I2S0_BCLK)
#define PA12MFP_UART4_TXD		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_UART4_TXD)
#define PA12MFP_I2C1_SCL		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_I2C1_SCL)
#define PA12MFP_SPI2_SS		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_SPI2_SS)
#define PA12MFP_CAN0_TXD		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_CAN0_TXD)
#define PA12MFP_SC2_PWR		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_SC2_PWR)
#define PA12MFP_BPWM1_CH2		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_BPWM1_CH2)
#define PA12MFP_QEI1_INDEX		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_QEI1_INDEX)
#define PA12MFP_USB_VBUS		NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_USB_VBUS)
#define PA13MFP_GPIO		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_GPIO)
#define PA13MFP_I2S0_MCLK		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_I2S0_MCLK)
#define PA13MFP_UART4_RXD		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_UART4_RXD)
#define PA13MFP_I2C1_SDA		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_I2C1_SDA)
#define PA13MFP_SPI2_CLK		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_SPI2_CLK)
#define PA13MFP_CAN0_RXD		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_CAN0_RXD)
#define PA13MFP_SC2_RST		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_SC2_RST)
#define PA13MFP_BPWM1_CH3		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_BPWM1_CH3)
#define PA13MFP_QEI1_A		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_QEI1_A)
#define PA13MFP_USB_D_N		NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_USB_D_N)
#define PA14MFP_GPIO		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_GPIO)
#define PA14MFP_I2S0_DI		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_I2S0_DI)
#define PA14MFP_UART0_TXD		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_UART0_TXD)
#define PA14MFP_SPI2_MISO		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_SPI2_MISO)
#define PA14MFP_I2C2_SCL		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_I2C2_SCL)
#define PA14MFP_SC2_DAT		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_SC2_DAT)
#define PA14MFP_BPWM1_CH4		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_BPWM1_CH4)
#define PA14MFP_QEI1_B		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_QEI1_B)
#define PA14MFP_USB_D_P		NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_USB_D_P)
#define PA15MFP_GPIO		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_GPIO)
#define PA15MFP_I2S0_DO		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_I2S0_DO)
#define PA15MFP_UART0_RXD		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_UART0_RXD)
#define PA15MFP_SPI2_MOSI		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_SPI2_MOSI)
#define PA15MFP_I2C2_SDA		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_I2C2_SDA)
#define PA15MFP_SC2_CLK		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_SC2_CLK)
#define PA15MFP_BPWM1_CH5		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_BPWM1_CH5)
#define PA15MFP_EPWM0_SYNC_IN		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_EPWM0_SYNC_IN)
#define PA15MFP_USB_OTG_ID		NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_USB_OTG_ID)
#define PB0MFP_GPIO		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_GPIO)
#define PB0MFP_EADC0_CH0		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_EADC0_CH0)
#define PB0MFP_EBI_ADR9		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_EBI_ADR9)
#define PB0MFP_SD0_CMD		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_SD0_CMD)
#define PB0MFP_SPI2_I2SMCLK		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_SPI2_I2SMCLK)
#define PB0MFP_UART2_RXD		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_UART2_RXD)
#define PB0MFP_SPI0_I2SMCLK		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_SPI0_I2SMCLK)
#define PB0MFP_I2C1_SDA		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_I2C1_SDA)
#define PB0MFP_EPWM0_CH5		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_EPWM0_CH5)
#define PB0MFP_EPWM1_CH5		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_EPWM1_CH5)
#define PB0MFP_EPWM0_BRAKE1		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_EPWM0_BRAKE1)
#define PB0MFP_QSPI0_MOSI1		NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_QSPI0_MOSI1)
#define PB1MFP_GPIO		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_GPIO)
#define PB1MFP_EADC0_CH1		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_EADC0_CH1)
#define PB1MFP_EBI_ADR8		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_EBI_ADR8)
#define PB1MFP_SD0_CLK		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_SD0_CLK)
#define PB1MFP_SPI1_I2SMCLK		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_SPI1_I2SMCLK)
#define PB1MFP_SPI3_I2SMCLK		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_SPI3_I2SMCLK)
#define PB1MFP_UART2_TXD		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_UART2_TXD)
#define PB1MFP_USCI1_CLK		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_USCI1_CLK)
#define PB1MFP_I2C1_SCL		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_I2C1_SCL)
#define PB1MFP_I2S0_LRCK		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_I2S0_LRCK)
#define PB1MFP_EPWM0_CH4		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_EPWM0_CH4)
#define PB1MFP_EPWM1_CH4		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_EPWM1_CH4)
#define PB1MFP_EPWM0_BRAKE0		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_EPWM0_BRAKE0)
#define PB1MFP_QSPI0_MISO1		NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_QSPI0_MISO1)
#define PB2MFP_GPIO		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_GPIO)
#define PB2MFP_ACMP0_P1		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_ACMP0_P1)
#define PB2MFP_EADC0_CH2		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_EADC0_CH2)
#define PB2MFP_EBI_ADR3		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_EBI_ADR3)
#define PB2MFP_SD0_DAT0		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_SD0_DAT0)
#define PB2MFP_SPI1_SS		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_SPI1_SS)
#define PB2MFP_UART1_RXD		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_UART1_RXD)
#define PB2MFP_USCI1_DAT0		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_USCI1_DAT0)
#define PB2MFP_SC0_PWR		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_SC0_PWR)
#define PB2MFP_I2S0_DO		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_I2S0_DO)
#define PB2MFP_EPWM0_CH3		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_EPWM0_CH3)
#define PB2MFP_I2C1_SDA		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_I2C1_SDA)
#define PB2MFP_TM5		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_TM5)
#define PB2MFP_TM3		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_TM3)
#define PB2MFP_INT3		NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_INT3)
#define PB3MFP_GPIO		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_GPIO)
#define PB3MFP_ACMP0_N		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_ACMP0_N)
#define PB3MFP_EADC0_CH3		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_EADC0_CH3)
#define PB3MFP_EBI_ADR2		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_EBI_ADR2)
#define PB3MFP_SD0_DAT1		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_SD0_DAT1)
#define PB3MFP_SPI1_CLK		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_SPI1_CLK)
#define PB3MFP_UART1_TXD		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_UART1_TXD)
#define PB3MFP_USCI1_DAT1		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_USCI1_DAT1)
#define PB3MFP_SC0_RST		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_SC0_RST)
#define PB3MFP_I2S0_DI		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_I2S0_DI)
#define PB3MFP_EPWM0_CH2		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_EPWM0_CH2)
#define PB3MFP_I2C1_SCL		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_I2C1_SCL)
#define PB3MFP_TM4		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_TM4)
#define PB3MFP_TM2		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_TM2)
#define PB3MFP_INT2		NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_INT2)
#define PB4MFP_GPIO		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_GPIO)
#define PB4MFP_ACMP1_P1		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_ACMP1_P1)
#define PB4MFP_EADC0_CH4		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_EADC0_CH4)
#define PB4MFP_EBI_ADR1		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_EBI_ADR1)
#define PB4MFP_SD0_DAT2		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_SD0_DAT2)
#define PB4MFP_SPI1_MOSI		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_SPI1_MOSI)
#define PB4MFP_I2C0_SDA		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_I2C0_SDA)
#define PB4MFP_UART5_RXD		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_UART5_RXD)
#define PB4MFP_USCI1_CTL1		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_USCI1_CTL1)
#define PB4MFP_SC0_DAT		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_SC0_DAT)
#define PB4MFP_I2S0_MCLK		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_I2S0_MCLK)
#define PB4MFP_EPWM0_CH1		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_EPWM0_CH1)
#define PB4MFP_UART2_RXD		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_UART2_RXD)
#define PB4MFP_TM1		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_TM1)
#define PB4MFP_INT1		NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_INT1)
#define PB5MFP_GPIO		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_GPIO)
#define PB5MFP_ACMP1_N		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_ACMP1_N)
#define PB5MFP_EADC0_CH5		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_EADC0_CH5)
#define PB5MFP_EBI_ADR0		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_EBI_ADR0)
#define PB5MFP_SD0_DAT3		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_SD0_DAT3)
#define PB5MFP_SPI1_MISO		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_SPI1_MISO)
#define PB5MFP_I2C0_SCL		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_I2C0_SCL)
#define PB5MFP_UART5_TXD		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_UART5_TXD)
#define PB5MFP_USCI1_CTL0		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_USCI1_CTL0)
#define PB5MFP_SC0_CLK		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_SC0_CLK)
#define PB5MFP_I2S0_BCLK		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_I2S0_BCLK)
#define PB5MFP_EPWM0_CH0		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_EPWM0_CH0)
#define PB5MFP_UART2_TXD		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_UART2_TXD)
#define PB5MFP_TM0		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_TM0)
#define PB5MFP_INT0		NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_INT0)
#define PB7MFP_GPIO		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_GPIO)
#define PB7MFP_EADC0_CH7		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_EADC0_CH7)
#define PB7MFP_USCI1_DAT0		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_USCI1_DAT0)
#define PB7MFP_UART1_TXD		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_UART1_TXD)
#define PB7MFP_BPWM1_CH4		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_BPWM1_CH4)
#define PB7MFP_EPWM1_BRAKE0		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_EPWM1_BRAKE0)
#define PB7MFP_EPWM1_CH4		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_EPWM1_CH4)
#define PB7MFP_INT5		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_INT5)
#define PB7MFP_USB_VBUS_ST		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_USB_VBUS_ST)
#define PB7MFP_ACMP0_O		NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_ACMP0_O)
#define PB12MFP_GPIO		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_GPIO)
#define PB12MFP_ACMP0_P2		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP0_P2)
#define PB12MFP_ACMP1_P2		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP1_P2)
#define PB12MFP_DAC0_OUT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_DAC0_OUT)
#define PB12MFP_EADC0_CH12		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EADC0_CH12)
#define PB12MFP_EBI_AD15		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EBI_AD15)
#define PB12MFP_SC1_CLK		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SC1_CLK)
#define PB12MFP_SPI0_MOSI		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SPI0_MOSI)
#define PB12MFP_USCI0_CLK		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_USCI0_CLK)
#define PB12MFP_UART0_RXD		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_UART0_RXD)
#define PB12MFP_I2C2_SDA		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_I2C2_SDA)
#define PB12MFP_EPWM1_CH3		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EPWM1_CH3)
#define PB12MFP_TM3_EXT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM3_EXT)
#define PB12MFP_TM5_EXT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM5_EXT)
#define PB13MFP_GPIO		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_GPIO)
#define PB13MFP_ACMP0_P3		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP0_P3)
#define PB13MFP_ACMP1_P3		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP1_P3)
#define PB13MFP_DAC1_OUT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_DAC1_OUT)
#define PB13MFP_EADC0_CH13		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EADC0_CH13)
#define PB13MFP_EBI_AD14		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EBI_AD14)
#define PB13MFP_SC1_DAT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SC1_DAT)
#define PB13MFP_SPI0_MISO		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SPI0_MISO)
#define PB13MFP_USCI0_DAT0		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_USCI0_DAT0)
#define PB13MFP_UART0_TXD		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_UART0_TXD)
#define PB13MFP_I2C2_SCL		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_I2C2_SCL)
#define PB13MFP_EPWM1_CH2		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EPWM1_CH2)
#define PB13MFP_TM2_EXT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM2_EXT)
#define PB13MFP_TM4_EXT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM4_EXT)
#define PB14MFP_GPIO		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_GPIO)
#define PB14MFP_EADC0_CH14		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EADC0_CH14)
#define PB14MFP_EBI_AD13		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EBI_AD13)
#define PB14MFP_SC1_RST		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SC1_RST)
#define PB14MFP_SPI0_CLK		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SPI0_CLK)
#define PB14MFP_USCI0_DAT1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_USCI0_DAT1)
#define PB14MFP_UART3_RXD		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_UART3_RXD)
#define PB14MFP_I2C2_SMBSUS		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_I2C2_SMBSUS)
